package com.example.studyit.data.services

import com.example.studyit.model.CLab
import java.util.*

/********************************************************************************************************
 * Интерфейс описывает все методы бизнес-логики, которые могут применятся к объектам типа               *
 * [CSubject].                                                                                          *
 * @author Селетков И.П. 2019 0211.                                                                     *
 *******************************************************************************************************/
interface IServiceLab                : IServiceBase<CLab, UUID>
{
}


