package ru.psu.studyit.data.repositories

import io.reactivex.Flowable
import ru.psu.studyit.data.CResource
import ru.psu.studyit.model.CSubject
import java.util.*

/********************************************************************************************************
 * Интерфейс описывает все методы бизнес-логики, которые могут применятся к объектам типа               *
 * [CSubject].                                                                                          *
 * @author Селетков И.П. 2019 0211.                                                                     *
 *******************************************************************************************************/
interface IRepositorySubject                : IRepositoryBase<CSubject, UUID>
{
    /****************************************************************************************************
     * Делает запрос на сервер, сохраняет в БД, возвращает список полученных дисциплин,                 *
     * которые должен проходить пользователь с текущей учётной записью.                                 *
     * @return - список дисциплин и статус.                                                             *
     ***************************************************************************************************/
    fun getResource(
    )                                       : Flowable<CResource<List<CSubject>>>
}