package ru.psu.studyit.utils.api

import io.reactivex.Single
import ru.psu.studyit.model.CCheckPoint
import ru.psu.studyit.model.CSubject

/********************************************************************************************************
 * Интерфейс описывает методы сервиса для работы с API сервера смарт-кситовчик.                         *
 * @author Селетков И.П. 2018 0816.                                                                     *
 *******************************************************************************************************/
interface IServiceServerAPI
{
    /****************************************************************************************************
     * Запрос списка дисциплин, которые изучает студент с текущей учётной записью.                      *
     * @return объект с возможность отслеживания статуса запроса.                                       *
     ***************************************************************************************************/
    fun fetchSubjects()                     : Single<List<CSubject>>

    /****************************************************************************************************
     * Запрос списка кт, которые изучает студент с текущей учётной записью.                             *
     * @return объект с возможность отслеживания статуса запроса.                                       *
     ***************************************************************************************************/
    fun fetchCheckPoints()                     : Single<List<CCheckPoint>>
}