package ru.psu.studyit.utils.api

import ru.psu.studyit.model.CSubject
import io.reactivex.Single
import retrofit2.http.GET
import ru.psu.studyit.model.CCheckPoint

/********************************************************************************************************
 * Интерфейс описывает запросы к API сервера.                                                           *
 * @author Селетков И.П. 2019 0211.                                                                     *
 *******************************************************************************************************/
interface IServerAPITemplate
{
    /****************************************************************************************************
     * Запрос списка дисциплин, которые изучает студент с текущей учётной записью.                      *
     * @return объект с возможность отслеживания статуса запроса.                                       *
     ***************************************************************************************************/
    @GET("subjects")
    fun getSubjects(
    )                                       : Single<List<CSubject>>

    /****************************************************************************************************
     * Запрос списка кт, которые изучает студент с текущей учётной записью.                             *
     * @return объект с возможность отслеживания статуса запроса.                                       *
     ***************************************************************************************************/
    @GET("checkpoints")
    fun getCheckPoints(
    )                                       : Single<List<CCheckPoint>>
}