package ru.psu.studyit.utils.api

import ru.psu.studyit.model.CSubject
import io.reactivex.Single
import retrofit2.Call
import retrofit2.http.GET
import retrofit2.http.Query

/********************************************************************************************************
 * Интерфейс описывает запросы к API сервера.                                                           *
 * @author Селетков И.П. 2019 0211.                                                                     *
 *******************************************************************************************************/
interface IServerAPITemplate
{
    /****************************************************************************************************
     * Запрос списка дисциплин.
     * по данным АСУ ТП.
     * @return объект с возможность отслеживания статуса запроса.
     ***************************************************************************************************/
    @GET("subjects")
    fun getSubjects(
    )                                       : Call<List<CSubject>>
}