package ru.psu.studyit.data.dao

import androidx.room.Dao
import androidx.room.Query
import ru.psu.studyit.model.CLab
import ru.psu.studyit.model.CSubject
import io.reactivex.Flowable
import io.reactivex.Single
import java.util.*

/********************************************************************************************************
 * Интерфейс позволяет выделить логику работы с разными источниками данных об объектах [CSubject]       *
 * из бизнес-логики приложения.                                                                         *
 * @author Балышев А.М. 2019 0323.                                                                    *
 *******************************************************************************************************/
@Dao
interface IDAOLab                    : IDAOBase<CLab, UUID> {
    /****************************************************************************************************
     * Возвращает список всех объектов типа [CSubject].                                                 *
     *                                                                                                  *
     * @return - список объектов с возможностью отслеживания изменений.                                 *
     ***************************************************************************************************/
    @Query("""
        SELECT *
        FROM Labs
    """)
    override fun get()                      : Single<List<CLab>>

    /****************************************************************************************************
     * Возвращает список всех объектов типа [CSubject], которые есть в базе данных с                    *
     * возможностью отслеживания изменений в составе списка.                                            *
     *                                                                                                  *
     * @return - список объектов с возможностью отслеживания изменений.                                 *
     ***************************************************************************************************/
    @Query("""
        SELECT *
        FROM Labs
    """)
    override fun getFlowable()              : Flowable<List<CLab>>

    /****************************************************************************************************
     * Возвращает объект типа [CSubject] по идентификатору [id].                                        *
     *                                                                                                  *
     * @param id - идентификатор объекта.                                                               *
     * @return - обёртка над объектом с возможностью отслеживания изменений.                            *
     ***************************************************************************************************/
    @Query("""
        SELECT *
        FROM Labs
        WHERE id                            = :id
        LIMIT 1
    """)
    override fun get(
            id                                  : UUID
    )                                       : Single<CLab>
    /****************************************************************************************************
     * Возвращает объект типа [CSubject] по идентификатору [id] с возможностью отслеживания             *
     * изменений объекта.                                                                               *
     *                                                                                                  *
     * @param id - идентификатор объекта.                                                               *
     * @return - обёртка над объектом с возможностью отслеживания изменений.                            *
     ***************************************************************************************************/
    @Query("""
        SELECT *
        FROM Labs
        WHERE id                            = :id
        LIMIT 1
    """)
    override fun getFlowable(
            id                                  : UUID
    )                                       : Flowable<CLab>
    /****************************************************************************************************
     * Возвращает объект типа [CSubject] по идентификатору [id].                                        *
     *                                                                                                  *
     * @param id - идентификатор объекта.                                                               *
     * @return - обёртка над объектом с возможностью отслеживания изменений.                            *
     ***************************************************************************************************/
    @Query("""
        SELECT *
        FROM Labs
        WHERE id                            = :id
        LIMIT 1
    """)
    override fun getSync(
            id                                  : UUID
    )                                       : CLab?
}
