package ru.psu.studyit.data.dao

import androidx.room.Dao
import androidx.room.Query
import ru.psu.studyit.model.CSubject
import io.reactivex.Flowable
import io.reactivex.Single
import ru.psu.studyit.model.CCheckPoint
import java.util.*

/********************************************************************************************************
 * Интерфейс позволяет выделить логику работы с разными источниками данных об объектах [CCheckPoint]    *
 * из бизнес-логики приложения.                                                                         *
 * @author Плюснин и Ко. 2019 0429.                                                                     *
 *******************************************************************************************************/
@Dao
interface IDAOCheckPoint                   : IDAOBase<CCheckPoint, UUID>
{
    /****************************************************************************************************
     * Возвращает список всех объектов типа [CCheckPoint].                                                 *
     *                                                                                                  *
     * @return - список объектов с возможностью отслеживания изменений.                                 *
     ***************************************************************************************************/
    @Query("""
        SELECT *
        FROM checkpoints
    """)
    override fun get()                      : Single<List<CCheckPoint>>

    /****************************************************************************************************
     * Возвращает список всех объектов типа [CCheckPoint], которые есть в базе данных с                    *
     * возможностью отслеживания изменений в составе списка.                                            *
     *                                                                                                  *
     * @return - список объектов с возможностью отслеживания изменений.                                 *
     ***************************************************************************************************/
    @Query("""
        SELECT *
        FROM checkpoints
    """)
    override fun getFlowable()              : Flowable<List<CCheckPoint>>

    /****************************************************************************************************
     * Возвращает объект типа [CCheckPoint] по идентификатору [id].                                        *
     *                                                                                                  *
     * @param id - идентификатор объекта.                                                               *
     * @return - обёртка над объектом с возможностью отслеживания изменений.                            *
     ***************************************************************************************************/
    @Query("""
        SELECT *
        FROM checkpoints
        WHERE id                            = :id
        LIMIT 1
    """)
    override fun get(
            id                                  : UUID
    )                                       : Single<CCheckPoint>
    /****************************************************************************************************
     * Возвращает объект типа [CCheckPoint] по идентификатору [id] с возможностью отслеживания             *
     * изменений объекта.                                                                               *
     *                                                                                                  *
     * @param id - идентификатор объекта.                                                               *
     * @return - обёртка над объектом с возможностью отслеживания изменений.                            *
     ***************************************************************************************************/
    @Query("""
        SELECT *
        FROM checkpoints
        WHERE id                            = :id
        LIMIT 1
    """)
    override fun getFlowable(
            id                                  : UUID
    )                                       : Flowable<CCheckPoint>
    /****************************************************************************************************
     * Возвращает объект типа [CCheckPoint] по идентификатору [id].                                        *
     *                                                                                                  *
     * @param id - идентификатор объекта.                                                               *
     * @return - обёртка над объектом с возможностью отслеживания изменений.                            *
     ***************************************************************************************************/
    @Query("""
        SELECT *
        FROM checkpoints
        WHERE id                            = :id
        LIMIT 1
    """)
    override fun getSync(
            id                                  : UUID
    )                                       : CCheckPoint?

}